# Module 4 Assignment

#### 4.1 Given three lists: list_1 = [1,2,3,4,16], list_2=["1","2","3","4","F"], and list_3= ["PA","NJ"]
#### 4.2 Create a data frame using pandas package and the above lists so that list_1 and list_2 are indexed by list_3

In [11]:
import pandas as pd

list_1 = [1, 2, 3, 4, 16]
list_2 = ['1', '2', '3', '4', 'F']
list_3 = ['PA', 'NJ']

df = pd.DataFrame(list(zip(list_1, list_2)), columns = list_3) # I could have also stored both lists in a a new list and used list_3 as an index, list(zip()) requires less lines of code.
df.transpose() # Transposing because I used list_3 as columns instead of index originally

    0  1  2  3   4
PA  1  2  3  4  16
NJ  1  2  3  4   F

#### 4.3 Multiply every value by 5 (hint: use anonymous function, i.e. lamda function: e.g. df.apply(lamda x: x*2) will multiply every value by 2). Use markdown cells to discuss if there are problems with the results.

In [19]:
df.apply(lambda x: x * 5).transpose() # Multiplies the values by 5

        0      1      2      3      4
PA      5     10     15     20     80
NJ  11111  22222  33333  44444  FFFFF

Due to the fact that the NJ data was inserted as a string the multiplication results in the string being repeated 5 times.

In [22]:
df2 = df.apply(lambda x : pd.to_numeric(x, errors='coerce')) #Storing a converted version of df using pd.to_numeric()
df2.transpose()

      0    1    2    3     4
PA  1.0  2.0  3.0  4.0  16.0
NJ  1.0  2.0  3.0  4.0   NaN

The 5th value in NJ was an alpha character and therefore errored during the data type conversion.

In [23]:
df2.apply(lambda x: x * 5).transpose() # Multiplies the values by 5

      0     1     2     3     4
PA  5.0  10.0  15.0  20.0  80.0
NJ  5.0  10.0  15.0  20.0   NaN

Now all values have been multiplied by 5, with the exception of NJ's 5th value, because it was an alpha character.